export const electricalItems: FieldType[] = [
  {
    id: 1,
    label: "લાઈટ + ફેન પોઈન્ટ (આખા)",
  },
  {
    id: 2,
    label: "પ્લગ પોઈન્ટ (અડધા)",
  },
  {
    id: 3,
    label: "ટુ-વે પોઈન્ટ (ડબલ)",
  },
  {
    id: 4,
    label: "ડોમેસ્ટિક પોઈન્ટ (દોઢ)",
  },
  {
    id: 5,
    label: "બેલ પોઈન્ટ (દોઢ)",
  },
  {
    id: 6,
    label: "બે-સ્વીચ + બે-પ્લગ પોઈન્ટ (ડબલ)",
  },
  {
    id: 7,
    label: "એ.સી. પોઈન્ટ (દોઢ)",
  },
  {
    id: 8,
    label: "એન્ટેના + સ્ટીરીયો પોઈન્ટ (આખા)",
  },
  {
    id: 9,
    label: "ઈન્વેટર પોઈન્ટ (બોર્ડ-ટુ-બોર્ડ)",
  },
  {
    id: 10,
    label: "મેઈન પોઈન્ટ (મેઈન લાઈન મુજબ)",
  },
  {
    id: 11,
    label: "ઈન્ટરનેટ પોઈન્ટ (મીટર + મજૂરી)",
  },
  {
    id: 12,
    label: "એ.સી. + મેઈન લાઈન (મીટર ભાવ)",
  },
  {
    id: 13,
    label: "રેગ્યુલેટર, એમ.સી.બી., એ.સી. પોઈન્ટ અને એ.સી. સ્ટાટર (અલગ)",
  },
  {
    id: 14,
    label: "ટયુબ, સીલિંગ લાઈટ અને ફેન ફિટિંગ ચાર્જ (અલગ)",
  },
];

export const wiredDetails: FieldType[] = [
  {
    id: 1,
    label: "વાયર કંપની",
    value: "", // ટેક્સ્ટ ફીલ્ડ
  },
  {
    id: 2,
    label: "એસેસરીઝ કંપની",
    value: "", // ટેક્સ્ટ ફીલ્ડ
  },
  {
    id: 3,
    label: "પોઈન્ટ વાયર",
    value: "",
    unit: "Sq.mm",
  },
  {
    id: 4,
    label: "બોર્ડ વાયર",
    value: "",
    unit: "Sq.mm",
  },
];

export const priceFields: FieldType[] = [
  {
    id: 1,
    label: "લાઈટિંગ પોઈન્ટ ભાવ",
    value: 0,
  },
  {
    id: 2,
    label: "મેઈન + એ.સી. લાઈન (1.5mm) ભાવ",
    value: 0,
  },
  {
    id: 3,
    label: "મેઈન + એ.સી. લાઈન (2.5mm) ભાવ",
    value: 0,
  },
  {
    id: 4,
    label: "પેનલ લાઈટ + ફેસી લાઈટ ફિટિંગ ચાર્જ",
    value: 0, // ફિટિંગ ચાર્જ માટે પ્રારંભિક મૂલ્ય
  },

  {
    id: 5,
    label: "ફેન ફિટિંગ ચાર્જ",
    value: 0,
  },
  {
    id: 6,
    label: "ફેન હૂક ફિટિંગ ચાર્જ",
    value: 0,
  },
  {
    id: 7,
    label: "પ્રોફાઈલ લાઈટ + રોપ લાઈટ ફિટિંગ ચાર્જ",
    value: 0, // ફિટિંગ ચાર્જ માટે પ્રારંભિક મૂલ્ય
  },
  {
    id: 8,
    label: "M.C.B. બોર્ડ ફિટિંગ ચાર્જ",
    value: 0, // ફિટિંગ ચાર્જ માટે પ્રારંભિક મૂલ્ય
  },
  {
    id: 9,
    label: "M.C.B. ડીપી ફિટિંગ ચાર્જ",
    value: 0, // ફિટિંગ ચાર્જ માટે પ્રારંભિક મૂલ્ય
  },
  {
    id: 10,
    label: "નેટ કેબલ - કેમેરા કેબલ - ડીસ કેબલ ફિટિંગ ચાર્જ (એક્સેસરીઝ વિના)",
    value: 0, // ફિટિંગ ચાર્જ માટે પ્રારંભિક મૂલ્ય
  },
];

export interface FieldType {
  id: number;
  label: string;
  value?: number | string;
  unit?: string;
}
